blogs/使用ruby实现最大堆（创建、删除、插入和堆排序）.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org85b6615">1. 最大堆的内存表现形式</a></li>
<li><a href="#orga70297a">2. 最大堆的插入</a></li>
<li><a href="#orgcd4e705">3. 最大堆的删除</a></li>
<li><a href="#orgd0b29b8">4. 最大堆的创建</a></li>
<li><a href="#org59675b6">5. 总结</a></li>
</ul>
</div>
</div>
<blockquote>
<p>
本文参考：<a href="https://www.jianshu.com/p/21bef3fc3030">https://www.jianshu.com/p/21bef3fc3030</a>
另，个人博客使用的Organismo gem还在开发中，尚不支持org mode图片，所以本文没有图片
</p>
</blockquote>

<div id="outline-container-org85b6615" class="outline-2">
<h2 id="org85b6615"><span class="section-number-2">1</span> 最大堆的内存表现形式</h2>
<div class="outline-text-2" id="text-1">
<p>
最大堆使用数组形式实现，因为最大堆是完全二叉树，所以不会存在数组空间的浪费，可以通过bfs的层序遍历实现。当然我们先试着自己创建一个抽象的堆。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">Node</span>
  <span style="color: #d08770;">attr_accessor</span> <span style="color: #d08770;">:value</span>, <span style="color: #d08770;">:left</span>, <span style="color: #d08770;">:right</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">initialize</span><span style="color: #8c8c8c;">(</span>value, left, right<span style="color: #8c8c8c;">)</span>
    <span style="color: #bf616a;">@value</span> = value
    <span style="color: #bf616a;">@left</span> = left
    <span style="color: #bf616a;">@right</span> = right
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>

<span style="color: #c0c5ce;"># </span><span style="color: #65737e;">&#22534;&#30340;&#23454;&#29616;</span>
<span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">Heap</span>
  <span style="color: #d08770;">attr_accessor</span> <span style="color: #d08770;">:root</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">initialize</span><span style="color: #8c8c8c;">(</span>value<span style="color: #8c8c8c;">)</span>
    <span style="color: #bf616a;">@root</span> = <span style="color: #c0c5ce;">Node</span>.new<span style="color: #8c8c8c;">(</span>value, <span style="color: #d08770;">nil</span>, <span style="color: #d08770;">nil</span><span style="color: #8c8c8c;">)</span>
  <span style="color: #b48ead;">end</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">add</span><span style="color: #8c8c8c;">(</span>value<span style="color: #8c8c8c;">)</span>
    <span style="color: #b48ead;">if</span> final_node.left.nil?
      final_node.left = <span style="color: #c0c5ce;">Node</span>.new<span style="color: #8c8c8c;">(</span>value, <span style="color: #d08770;">nil</span>, <span style="color: #d08770;">nil</span><span style="color: #8c8c8c;">)</span>
    <span style="color: #b48ead;">else</span>
      final_node.right = <span style="color: #c0c5ce;">Node</span>.new<span style="color: #8c8c8c;">(</span>value, <span style="color: #d08770;">nil</span>, <span style="color: #d08770;">nil</span><span style="color: #8c8c8c;">)</span>
    <span style="color: #b48ead;">end</span>
  <span style="color: #b48ead;">end</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">bfs</span><span style="color: #8c8c8c;">(</span>node = <span style="color: #bf616a;">@root</span><span style="color: #8c8c8c;">)</span>
    heap_arr = <span style="color: #8c8c8c;">[]</span>
    current_node = node
    queue = <span style="color: #8c8c8c;">[]</span>
    queue &lt;&lt; current_node

    <span style="color: #b48ead;">while</span> queue.any? <span style="color: #b48ead;">do</span>
      current_node = queue.shift
      heap_arr &lt;&lt; current_node.value.to_s

      queue &lt;&lt; current_node.left
      queue &lt;&lt; current_node.right

      queue.compact!
    <span style="color: #b48ead;">end</span>
    <span style="color: #8c8c8c;">[</span>current_node, heap_arr<span style="color: #8c8c8c;">]</span>
  <span style="color: #b48ead;">end</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">final_node</span>
    bfs<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">0</span><span style="color: #8c8c8c;">]</span>
  <span style="color: #b48ead;">end</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">to_array</span>
    bfs<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span>.map<span style="color: #8c8c8c;">(</span>&amp;<span style="color: #d08770;">:to_i</span><span style="color: #8c8c8c;">)</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>
</pre>
</div>

<p>
关键在于bfs方法，bfs就是使用宽度有限的层序遍历，在bfs方法中，我们定义了一个先入先出的队列，每遍历到一个根结点，就把它的子节点加入队列，最后返回最后一个子节点和遍历的数组。
</p>

<p>
我们可以通过to<sub>array将Heap变成数组的表现形式</sub>。但是在数组中我们如何表示父节点和左右子节点呢。
</p>
<ul class="org-ul">
<li>父节点：i/2 (i != 1)，若i == 1，则i是根结点</li>
<li>左子节点：2i (2i &lt;= n)，若不满足则无左子节点</li>
<li>右子节点：2i + 1 (2i + 1 &lt;= n)，若不满足则无右子结点</li>
</ul>
</div>
</div>

<div id="outline-container-orga70297a" class="outline-2">
<h2 id="orga70297a"><span class="section-number-2">2</span> 最大堆的插入</h2>
<div class="outline-text-2" id="text-2">
<p>
最大堆的插入是“结点上浮”，插入的位置一定是最后的子节点，这样才能保证依然是完全二叉树。然后需要“上浮”，和父节点比较做出位置变化。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">MaxHeap</span>
  <span style="color: #d08770;">attr_accessor</span> <span style="color: #d08770;">:heap_arr</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">initialize</span><span style="color: #8c8c8c;">(</span>heap_arr<span style="color: #8c8c8c;">)</span>
    <span style="color: #bf616a;">@heap_arr</span> = <span style="color: #8c8c8c;">[</span><span style="color: #d08770;">nil</span><span style="color: #8c8c8c;">]</span> + heap_arr
  <span style="color: #b48ead;">end</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">insert</span><span style="color: #8c8c8c;">(</span>value<span style="color: #8c8c8c;">)</span>
    i = heap_arr.size
    heap_arr<span style="color: #8c8c8c;">[</span>i<span style="color: #8c8c8c;">]</span> = value

    <span style="color: #b48ead;">while</span> i &gt; <span style="color: #d08770;">1</span> &amp;&amp; value &gt; heap_arr<span style="color: #8c8c8c;">[</span>i / <span style="color: #d08770;">2</span><span style="color: #8c8c8c;">]</span> <span style="color: #b48ead;">do</span>
      tmp = heap_arr<span style="color: #8c8c8c;">[</span>i<span style="color: #8c8c8c;">]</span>
      heap_arr<span style="color: #8c8c8c;">[</span>i<span style="color: #8c8c8c;">]</span> = heap_arr<span style="color: #8c8c8c;">[</span>i / <span style="color: #d08770;">2</span><span style="color: #8c8c8c;">]</span>
      heap_arr<span style="color: #8c8c8c;">[</span>i / <span style="color: #d08770;">2</span><span style="color: #8c8c8c;">]</span> = tmp
      i = i / <span style="color: #d08770;">2</span>
    <span style="color: #b48ead;">end</span>
    heap_arr
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>
</pre>
</div>

<p>
initialize中前面加一个[nil]是因为堆变为数组后第一个元素的角标为1比较好处理。
</p>
</div>
</div>

<div id="outline-container-orgcd4e705" class="outline-2">
<h2 id="orgcd4e705"><span class="section-number-2">3</span> 最大堆的删除</h2>
<div class="outline-text-2" id="text-3">
<p>
最大堆的删除的就是删除根结点，关键是删除之后为了让堆依然作为完全二叉树，就需要把最后一个子节点放到根结点上，然后执行这个结点的“下沉”
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">MaxHeap</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">delete</span>
    heap_arr<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> = heap_arr.last
    heap_arr.pop

    parent = <span style="color: #d08770;">1</span>
    child = <span style="color: #d08770;">2</span>

    <span style="color: #b48ead;">while</span> child &lt; heap_arr.size <span style="color: #b48ead;">do</span>
      <span style="color: #b48ead;">if</span> heap_arr<span style="color: #8c8c8c;">[</span>child<span style="color: #8c8c8c;">]</span> &gt; heap_arr<span style="color: #8c8c8c;">[</span>parent<span style="color: #8c8c8c;">]</span>
        heap_arr = heap_arr.swap<span style="color: #8c8c8c;">(</span>child-<span style="color: #d08770;">1</span>, parent-<span style="color: #d08770;">1</span><span style="color: #8c8c8c;">)</span>
        child += <span style="color: #d08770;">1</span>

        <span style="color: #b48ead;">if</span> heap_arr<span style="color: #8c8c8c;">[</span>child<span style="color: #8c8c8c;">]</span> &gt; heap_arr<span style="color: #8c8c8c;">[</span>parent<span style="color: #8c8c8c;">]</span>
          heap_arr = heap_arr.swap<span style="color: #8c8c8c;">(</span>child-<span style="color: #d08770;">1</span>, parent-<span style="color: #d08770;">1</span><span style="color: #8c8c8c;">)</span>
          parent = <span style="color: #8c8c8c;">(</span>child - <span style="color: #d08770;">1</span><span style="color: #8c8c8c;">)</span> * <span style="color: #d08770;">2</span>
        <span style="color: #b48ead;">else</span>
          parent = child * <span style="color: #d08770;">2</span>
        <span style="color: #b48ead;">end</span>
        child = parent * <span style="color: #d08770;">2</span>
      <span style="color: #b48ead;">end</span>
    <span style="color: #b48ead;">end</span>
    heap_arr
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>

<span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">Array</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">swap</span><span style="color: #8c8c8c;">(</span>a, b<span style="color: #8c8c8c;">)</span>
    tmp = <span style="color: #b48ead;">self</span><span style="color: #8c8c8c;">[</span>a<span style="color: #8c8c8c;">]</span>
    <span style="color: #b48ead;">self</span><span style="color: #8c8c8c;">[</span>a<span style="color: #8c8c8c;">]</span> = <span style="color: #b48ead;">self</span><span style="color: #8c8c8c;">[</span>b<span style="color: #8c8c8c;">]</span>
    <span style="color: #b48ead;">self</span><span style="color: #8c8c8c;">[</span>b<span style="color: #8c8c8c;">]</span> = tmp
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>
</pre>
</div>

<p>
最大堆的删除说明删除之前必须是最大堆，然后从根结点开始下沉。
</p>
</div>
</div>

<div id="outline-container-orgd0b29b8" class="outline-2">
<h2 id="orgd0b29b8"><span class="section-number-2">4</span> 最大堆的创建</h2>
<div class="outline-text-2" id="text-4">
<p>
其实最大堆的创建就可以利用上面最大堆的插入或者删除的原理。利用最大堆的每一个子树还是最大堆的特点，我们可以从最末端的子树开始。然后逐个忘上遍历。然后逐个“下沉”
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">MaxHeap</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">initialize</span><span style="color: #8c8c8c;">(</span>heap_arr<span style="color: #8c8c8c;">)</span>
    <span style="color: #bf616a;">@heap_arr</span> = <span style="color: #8c8c8c;">(</span><span style="color: #93a8c6;">[</span><span style="color: #d08770;">nil</span><span style="color: #93a8c6;">]</span> + heap_arr<span style="color: #8c8c8c;">)</span>.to_max_heap_arr
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>

<span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">Array</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">to_max_heap_arr</span>
    <span style="color: #c0c5ce;"># </span><span style="color: #65737e;">&#25214;&#21040;&#26368;&#21518;&#19968;&#20010;&#26681;&#32467;&#28857;</span>
    parent = <span style="color: #8c8c8c;">(</span><span style="color: #b48ead;">self</span>.size / <span style="color: #d08770;">2</span><span style="color: #8c8c8c;">)</span>.to_i

    <span style="color: #b48ead;">while</span> parent &gt; <span style="color: #d08770;">0</span> <span style="color: #b48ead;">do</span>
      left_child = parent * <span style="color: #d08770;">2</span>
      right_child = parent * <span style="color: #d08770;">2</span> + <span style="color: #d08770;">1</span>

      <span style="color: #b48ead;">if</span> <span style="color: #b48ead;">self</span><span style="color: #8c8c8c;">[</span>left_child<span style="color: #8c8c8c;">]</span> &gt; <span style="color: #b48ead;">self</span><span style="color: #8c8c8c;">[</span>parent<span style="color: #8c8c8c;">]</span>
        <span style="color: #b48ead;">self</span>.swap<span style="color: #8c8c8c;">(</span>left_child, parent<span style="color: #8c8c8c;">)</span>
      <span style="color: #b48ead;">end</span>

      <span style="color: #b48ead;">if</span> <span style="color: #b48ead;">self</span><span style="color: #8c8c8c;">[</span>right_child<span style="color: #8c8c8c;">]</span> &amp;&amp; <span style="color: #b48ead;">self</span><span style="color: #8c8c8c;">[</span>right_child<span style="color: #8c8c8c;">]</span> &gt; <span style="color: #b48ead;">self</span><span style="color: #8c8c8c;">[</span>parent<span style="color: #8c8c8c;">]</span>
        <span style="color: #b48ead;">self</span>.swap<span style="color: #8c8c8c;">(</span>right_child, parent<span style="color: #8c8c8c;">)</span>
      <span style="color: #b48ead;">end</span>

      parent -= <span style="color: #d08770;">1</span>
    <span style="color: #b48ead;">end</span>
    <span style="color: #b48ead;">self</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org59675b6" class="outline-2">
<h2 id="org59675b6"><span class="section-number-2">5</span> 总结</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>最大堆插入：“上升法”，只在自己树分支上的子节点和父节点比较</li>
<li>最大堆删除：“下沉法”，最后一个子节点替换被删除的根节点，然后在单个树分支上不断下沉</li>
<li>最大堆创建：“下沉法”，和删除不一样的是，需要对根节点进行倒叙遍历下沉，每次下沉只是下沉一步，就继续遍历下一个树。</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.1.13)</p>
</div>
</div>
</body>
</html>
